[
	{
		"version": "2.1.2",
		"date": "Jul 26, 2014",
		"fixed": [
			"Some styles were getting mangled by advanced minification mode."
		]
	},
	{
		"version": "2.1.0",
		"date": "Jul 25, 2014",
		"new": [
			"Keyword Antispam now has a configurable limit of entries after which the user is unchecked."
		],
		"changed": [
			"Changelogs are now collapsible."
		],
		"fixed": [
			"Broken links in FAQ & Changelog.",
			"All links now open in a new window to not destroy the Giveaways session."
		]
	},
	{
		"version": "2.0.0",
		"date": "Jul 24, 2014",
		"description": [
			"First of all, I'm <strong>really</strong> sorry how long it took to get this done! The rewrite got out of hand and the extension is now a small application with tons of useful features :)",
			"I specifically focused on making it as small and as fast as possible. If you are interested in technologies used, visit the <a href=\"https://github.com/darsain/twitch-giveaways\" target=\"_blank\">extension repository</a>.",
			"Below are some key changes that might be of interest to you:"
		],
		"new": [
			"Now runs in all popped out or embedded chats, including the one in your dashboard.",
			"Subscribers only filter.",
			"Search bar. <em>Start query with \"<strong>!</strong>\" to search only unchecked people.</em>",
			"Custom ignore list. See Configuration section."
		],
		"changed": [
			"User list - as well as the whole app - now implements all speed optimization techniques in the universe (DOM diffing, binary search sorting, occlusion culling,...), which means the speed of rendering and scrolling is the same when there is 10 or 10,000 people. This is way more efficient than the pre-rewrite versions which had a naive implementation that took seconds to render on big channels, freezing the UI thread, and needed to be delayed. The list you see now is real time and jank-free."
		],
		"removed": [
			"No longer possible to load the whole list of people in chat. They have to write something to be registered by extension."
		]
	}, {
		"version": "1.5.4",
		"date": "Mar 28, 2014",
		"description": [
			"Last pre-rewrite version."
		]
	}
]